export const officialRecords2026 = [
  {
    "issue": "2026171",
    "date": "2026-06-20",
    "regular": [
      24,
      38,
      40,
      31,
      42,
      46
    ],
    "special": 28,
    "zodiacs": [
      "羊",
      "蛇",
      "兔",
      "鼠",
      "牛",
      "鸡",
      "兔"
    ]
  },
  {
    "issue": "2026170",
    "date": "2026-06-19",
    "regular": [
      27,
      46,
      6,
      38,
      20,
      34
    ],
    "special": 3,
    "zodiacs": [
      "龙",
      "鸡",
      "牛",
      "蛇",
      "猪",
      "鸡",
      "龙"
    ]
  },
  {
    "issue": "2026169",
    "date": "2026-06-18",
    "regular": [
      44,
      37,
      30,
      8,
      40,
      22
    ],
    "special": 24,
    "zodiacs": [
      "猪",
      "马",
      "牛",
      "猪",
      "兔",
      "鸡",
      "羊"
    ]
  },
  {
    "issue": "2026168",
    "date": "2026-06-17",
    "regular": [
      27,
      11,
      24,
      5,
      40,
      33
    ],
    "special": 15,
    "zodiacs": [
      "龙",
      "猴",
      "羊",
      "虎",
      "兔",
      "狗",
      "龙"
    ]
  },
  {
    "issue": "2026167",
    "date": "2026-06-16",
    "regular": [
      23,
      3,
      40,
      39,
      7,
      11
    ],
    "special": 19,
    "zodiacs": [
      "猴",
      "龙",
      "兔",
      "龙",
      "鼠",
      "猴",
      "鼠"
    ]
  },
  {
    "issue": "2026166",
    "date": "2026-06-15",
    "regular": [
      20,
      15,
      1,
      4,
      21,
      28
    ],
    "special": 6,
    "zodiacs": [
      "猪",
      "龙",
      "马",
      "兔",
      "狗",
      "兔",
      "牛"
    ]
  },
  {
    "issue": "2026165",
    "date": "2026-06-14",
    "regular": [
      11,
      47,
      9,
      49,
      2,
      1
    ],
    "special": 3,
    "zodiacs": [
      "猴",
      "猴",
      "狗",
      "马",
      "蛇",
      "马",
      "龙"
    ]
  },
  {
    "issue": "2026164",
    "date": "2026-06-13",
    "regular": [
      46,
      4,
      38,
      12,
      3,
      2
    ],
    "special": 21,
    "zodiacs": [
      "鸡",
      "兔",
      "蛇",
      "羊",
      "龙",
      "蛇",
      "狗"
    ]
  },
  {
    "issue": "2026163",
    "date": "2026-06-12",
    "regular": [
      39,
      8,
      10,
      33,
      7,
      41
    ],
    "special": 37,
    "zodiacs": [
      "龙",
      "猪",
      "鸡",
      "狗",
      "鼠",
      "虎",
      "马"
    ]
  },
  {
    "issue": "2026162",
    "date": "2026-06-11",
    "regular": [
      23,
      41,
      24,
      26,
      33,
      7
    ],
    "special": 32,
    "zodiacs": [
      "猴",
      "虎",
      "羊",
      "蛇",
      "狗",
      "鼠",
      "猪"
    ]
  },
  {
    "issue": "2026161",
    "date": "2026-06-10",
    "regular": [
      36,
      40,
      42,
      19,
      34,
      46
    ],
    "special": 8,
    "zodiacs": [
      "羊",
      "兔",
      "牛",
      "鼠",
      "鸡",
      "鸡",
      "猪"
    ]
  },
  {
    "issue": "2026160",
    "date": "2026-06-09",
    "regular": [
      8,
      16,
      26,
      1,
      29,
      30
    ],
    "special": 2,
    "zodiacs": [
      "猪",
      "兔",
      "蛇",
      "马",
      "虎",
      "牛",
      "蛇"
    ]
  },
  {
    "issue": "2026159",
    "date": "2026-06-08",
    "regular": [
      12,
      4,
      28,
      17,
      20,
      46
    ],
    "special": 39,
    "zodiacs": [
      "羊",
      "兔",
      "兔",
      "虎",
      "猪",
      "鸡",
      "龙"
    ]
  },
  {
    "issue": "2026158",
    "date": "2026-06-07",
    "regular": [
      43,
      48,
      3,
      1,
      12,
      23
    ],
    "special": 16,
    "zodiacs": [
      "鼠",
      "羊",
      "龙",
      "马",
      "羊",
      "猴",
      "兔"
    ]
  },
  {
    "issue": "2026157",
    "date": "2026-06-06",
    "regular": [
      43,
      25,
      11,
      31,
      17,
      10
    ],
    "special": 40,
    "zodiacs": [
      "鼠",
      "马",
      "猴",
      "鼠",
      "虎",
      "鸡",
      "兔"
    ]
  },
  {
    "issue": "2026156",
    "date": "2026-06-05",
    "regular": [
      31,
      16,
      11,
      3,
      37,
      12
    ],
    "special": 1,
    "zodiacs": [
      "鼠",
      "兔",
      "猴",
      "龙",
      "马",
      "羊",
      "马"
    ]
  },
  {
    "issue": "2026155",
    "date": "2026-06-04",
    "regular": [
      21,
      37,
      46,
      13,
      40,
      47
    ],
    "special": 7,
    "zodiacs": [
      "狗",
      "马",
      "鸡",
      "马",
      "兔",
      "猴",
      "鼠"
    ]
  },
  {
    "issue": "2026154",
    "date": "2026-06-03",
    "regular": [
      46,
      28,
      42,
      31,
      23,
      34
    ],
    "special": 41,
    "zodiacs": [
      "鸡",
      "兔",
      "牛",
      "鼠",
      "猴",
      "鸡",
      "虎"
    ]
  },
  {
    "issue": "2026153",
    "date": "2026-06-02",
    "regular": [
      1,
      38,
      33,
      28,
      6,
      40
    ],
    "special": 41,
    "zodiacs": [
      "马",
      "蛇",
      "狗",
      "兔",
      "牛",
      "兔",
      "虎"
    ]
  },
  {
    "issue": "2026152",
    "date": "2026-06-01",
    "regular": [
      34,
      47,
      16,
      36,
      44,
      1
    ],
    "special": 45,
    "zodiacs": [
      "鸡",
      "猴",
      "兔",
      "羊",
      "猪",
      "马",
      "狗"
    ]
  },
  {
    "issue": "2026151",
    "date": "2026-05-31",
    "regular": [
      27,
      15,
      29,
      42,
      20,
      41
    ],
    "special": 31,
    "zodiacs": [
      "龙",
      "龙",
      "虎",
      "牛",
      "猪",
      "虎",
      "鼠"
    ]
  },
  {
    "issue": "2026150",
    "date": "2026-05-30",
    "regular": [
      11,
      4,
      22,
      25,
      44,
      19
    ],
    "special": 9,
    "zodiacs": [
      "猴",
      "兔",
      "鸡",
      "马",
      "猪",
      "鼠",
      "狗"
    ]
  },
  {
    "issue": "2026149",
    "date": "2026-05-29",
    "regular": [
      28,
      30,
      44,
      45,
      4,
      20
    ],
    "special": 27,
    "zodiacs": [
      "兔",
      "牛",
      "猪",
      "狗",
      "兔",
      "猪",
      "龙"
    ]
  },
  {
    "issue": "2026148",
    "date": "2026-05-28",
    "regular": [
      28,
      24,
      31,
      23,
      4,
      27
    ],
    "special": 48,
    "zodiacs": [
      "兔",
      "羊",
      "鼠",
      "猴",
      "兔",
      "龙",
      "羊"
    ]
  },
  {
    "issue": "2026147",
    "date": "2026-05-27",
    "regular": [
      29,
      40,
      6,
      18,
      31,
      10
    ],
    "special": 13,
    "zodiacs": [
      "虎",
      "兔",
      "牛",
      "牛",
      "鼠",
      "鸡",
      "马"
    ]
  },
  {
    "issue": "2026146",
    "date": "2026-05-26",
    "regular": [
      11,
      30,
      20,
      19,
      5,
      16
    ],
    "special": 42,
    "zodiacs": [
      "猴",
      "牛",
      "猪",
      "鼠",
      "虎",
      "兔",
      "牛"
    ]
  },
  {
    "issue": "2026145",
    "date": "2026-05-25",
    "regular": [
      36,
      43,
      25,
      32,
      37,
      18
    ],
    "special": 5,
    "zodiacs": [
      "羊",
      "鼠",
      "马",
      "猪",
      "马",
      "牛",
      "虎"
    ]
  },
  {
    "issue": "2026144",
    "date": "2026-05-24",
    "regular": [
      47,
      31,
      29,
      33,
      22,
      26
    ],
    "special": 43,
    "zodiacs": [
      "猴",
      "鼠",
      "虎",
      "狗",
      "鸡",
      "蛇",
      "鼠"
    ]
  },
  {
    "issue": "2026143",
    "date": "2026-05-23",
    "regular": [
      13,
      26,
      18,
      32,
      2,
      33
    ],
    "special": 44,
    "zodiacs": [
      "马",
      "蛇",
      "牛",
      "猪",
      "蛇",
      "狗",
      "猪"
    ]
  },
  {
    "issue": "2026142",
    "date": "2026-05-22",
    "regular": [
      45,
      15,
      26,
      21,
      18,
      35
    ],
    "special": 23,
    "zodiacs": [
      "狗",
      "龙",
      "蛇",
      "狗",
      "牛",
      "猴",
      "猴"
    ]
  },
  {
    "issue": "2026141",
    "date": "2026-05-21",
    "regular": [
      43,
      8,
      17,
      2,
      34,
      32
    ],
    "special": 33,
    "zodiacs": [
      "鼠",
      "猪",
      "虎",
      "蛇",
      "鸡",
      "猪",
      "狗"
    ]
  },
  {
    "issue": "2026140",
    "date": "2026-05-20",
    "regular": [
      13,
      10,
      42,
      4,
      46,
      34
    ],
    "special": 16,
    "zodiacs": [
      "马",
      "鸡",
      "牛",
      "兔",
      "鸡",
      "鸡",
      "兔"
    ]
  },
  {
    "issue": "2026139",
    "date": "2026-05-19",
    "regular": [
      41,
      45,
      48,
      1,
      36,
      30
    ],
    "special": 24,
    "zodiacs": [
      "虎",
      "狗",
      "羊",
      "马",
      "羊",
      "牛",
      "羊"
    ]
  },
  {
    "issue": "2026138",
    "date": "2026-05-18",
    "regular": [
      38,
      22,
      6,
      24,
      20,
      46
    ],
    "special": 49,
    "zodiacs": [
      "蛇",
      "鸡",
      "牛",
      "羊",
      "猪",
      "鸡",
      "马"
    ]
  },
  {
    "issue": "2026137",
    "date": "2026-05-17",
    "regular": [
      24,
      20,
      32,
      5,
      19,
      7
    ],
    "special": 26,
    "zodiacs": [
      "羊",
      "猪",
      "猪",
      "虎",
      "鼠",
      "鼠",
      "蛇"
    ]
  },
  {
    "issue": "2026136",
    "date": "2026-05-16",
    "regular": [
      1,
      14,
      24,
      17,
      15,
      12
    ],
    "special": 48,
    "zodiacs": [
      "马",
      "蛇",
      "羊",
      "虎",
      "龙",
      "羊",
      "羊"
    ]
  },
  {
    "issue": "2026135",
    "date": "2026-05-15",
    "regular": [
      8,
      35,
      9,
      20,
      18,
      47
    ],
    "special": 30,
    "zodiacs": [
      "猪",
      "猴",
      "狗",
      "猪",
      "牛",
      "猴",
      "牛"
    ]
  },
  {
    "issue": "2026134",
    "date": "2026-05-14",
    "regular": [
      24,
      46,
      40,
      44,
      22,
      49
    ],
    "special": 37,
    "zodiacs": [
      "羊",
      "鸡",
      "兔",
      "猪",
      "鸡",
      "马",
      "马"
    ]
  },
  {
    "issue": "2026133",
    "date": "2026-05-13",
    "regular": [
      38,
      14,
      23,
      1,
      26,
      44
    ],
    "special": 7,
    "zodiacs": [
      "蛇",
      "蛇",
      "猴",
      "马",
      "蛇",
      "猪",
      "鼠"
    ]
  },
  {
    "issue": "2026132",
    "date": "2026-05-12",
    "regular": [
      48,
      11,
      20,
      44,
      39,
      35
    ],
    "special": 30,
    "zodiacs": [
      "羊",
      "猴",
      "猪",
      "猪",
      "龙",
      "猴",
      "牛"
    ]
  },
  {
    "issue": "2026131",
    "date": "2026-05-11",
    "regular": [
      12,
      40,
      21,
      32,
      1,
      25
    ],
    "special": 7,
    "zodiacs": [
      "羊",
      "兔",
      "狗",
      "猪",
      "马",
      "马",
      "鼠"
    ]
  },
  {
    "issue": "2026130",
    "date": "2026-05-10",
    "regular": [
      41,
      26,
      9,
      11,
      5,
      25
    ],
    "special": 29,
    "zodiacs": [
      "虎",
      "蛇",
      "狗",
      "猴",
      "虎",
      "马",
      "虎"
    ]
  },
  {
    "issue": "2026129",
    "date": "2026-05-09",
    "regular": [
      34,
      7,
      40,
      21,
      17,
      25
    ],
    "special": 41,
    "zodiacs": [
      "鸡",
      "鼠",
      "兔",
      "狗",
      "虎",
      "马",
      "虎"
    ]
  },
  {
    "issue": "2026128",
    "date": "2026-05-08",
    "regular": [
      25,
      46,
      2,
      7,
      45,
      42
    ],
    "special": 37,
    "zodiacs": [
      "马",
      "鸡",
      "蛇",
      "鼠",
      "狗",
      "牛",
      "马"
    ]
  },
  {
    "issue": "2026127",
    "date": "2026-05-07",
    "regular": [
      14,
      8,
      27,
      3,
      7,
      29
    ],
    "special": 45,
    "zodiacs": [
      "蛇",
      "猪",
      "龙",
      "龙",
      "鼠",
      "虎",
      "狗"
    ]
  },
  {
    "issue": "2026126",
    "date": "2026-05-06",
    "regular": [
      15,
      9,
      5,
      3,
      1,
      10
    ],
    "special": 49,
    "zodiacs": [
      "龙",
      "狗",
      "虎",
      "龙",
      "马",
      "鸡",
      "马"
    ]
  },
  {
    "issue": "2026125",
    "date": "2026-05-05",
    "regular": [
      16,
      19,
      7,
      30,
      38,
      39
    ],
    "special": 31,
    "zodiacs": [
      "兔",
      "鼠",
      "鼠",
      "牛",
      "蛇",
      "龙",
      "鼠"
    ]
  },
  {
    "issue": "2026124",
    "date": "2026-05-04",
    "regular": [
      46,
      5,
      10,
      17,
      12,
      22
    ],
    "special": 39,
    "zodiacs": [
      "鸡",
      "虎",
      "鸡",
      "虎",
      "羊",
      "鸡",
      "龙"
    ]
  },
  {
    "issue": "2026123",
    "date": "2026-05-03",
    "regular": [
      39,
      23,
      49,
      17,
      42,
      44
    ],
    "special": 46,
    "zodiacs": [
      "龙",
      "猴",
      "马",
      "虎",
      "牛",
      "猪",
      "鸡"
    ]
  },
  {
    "issue": "2026122",
    "date": "2026-05-02",
    "regular": [
      18,
      23,
      15,
      22,
      25,
      45
    ],
    "special": 1,
    "zodiacs": [
      "牛",
      "猴",
      "龙",
      "鸡",
      "马",
      "狗",
      "马"
    ]
  },
  {
    "issue": "2026121",
    "date": "2026-05-01",
    "regular": [
      45,
      21,
      35,
      48,
      6,
      20
    ],
    "special": 44,
    "zodiacs": [
      "狗",
      "狗",
      "猴",
      "羊",
      "牛",
      "猪",
      "猪"
    ]
  },
  {
    "issue": "2026120",
    "date": "2026-04-30",
    "regular": [
      18,
      24,
      7,
      23,
      48,
      20
    ],
    "special": 6,
    "zodiacs": [
      "牛",
      "羊",
      "鼠",
      "猴",
      "羊",
      "猪",
      "牛"
    ]
  },
  {
    "issue": "2026119",
    "date": "2026-04-29",
    "regular": [
      38,
      18,
      32,
      22,
      30,
      40
    ],
    "special": 11,
    "zodiacs": [
      "蛇",
      "牛",
      "猪",
      "鸡",
      "牛",
      "兔",
      "猴"
    ]
  },
  {
    "issue": "2026118",
    "date": "2026-04-28",
    "regular": [
      38,
      37,
      22,
      46,
      49,
      40
    ],
    "special": 8,
    "zodiacs": [
      "蛇",
      "马",
      "鸡",
      "鸡",
      "马",
      "兔",
      "猪"
    ]
  },
  {
    "issue": "2026117",
    "date": "2026-04-27",
    "regular": [
      45,
      2,
      46,
      33,
      19,
      7
    ],
    "special": 16,
    "zodiacs": [
      "狗",
      "蛇",
      "鸡",
      "狗",
      "鼠",
      "鼠",
      "兔"
    ]
  },
  {
    "issue": "2026116",
    "date": "2026-04-26",
    "regular": [
      15,
      46,
      16,
      10,
      48,
      33
    ],
    "special": 22,
    "zodiacs": [
      "龙",
      "鸡",
      "兔",
      "鸡",
      "羊",
      "狗",
      "鸡"
    ]
  },
  {
    "issue": "2026115",
    "date": "2026-04-25",
    "regular": [
      21,
      16,
      25,
      29,
      8,
      7
    ],
    "special": 4,
    "zodiacs": [
      "狗",
      "兔",
      "马",
      "虎",
      "猪",
      "鼠",
      "兔"
    ]
  },
  {
    "issue": "2026114",
    "date": "2026-04-24",
    "regular": [
      45,
      41,
      10,
      1,
      36,
      25
    ],
    "special": 30,
    "zodiacs": [
      "狗",
      "虎",
      "鸡",
      "马",
      "羊",
      "马",
      "牛"
    ]
  },
  {
    "issue": "2026113",
    "date": "2026-04-23",
    "regular": [
      42,
      22,
      15,
      17,
      32,
      49
    ],
    "special": 2,
    "zodiacs": [
      "牛",
      "鸡",
      "龙",
      "虎",
      "猪",
      "马",
      "蛇"
    ]
  },
  {
    "issue": "2026112",
    "date": "2026-04-22",
    "regular": [
      15,
      19,
      30,
      7,
      44,
      10
    ],
    "special": 9,
    "zodiacs": [
      "龙",
      "鼠",
      "牛",
      "鼠",
      "猪",
      "鸡",
      "狗"
    ]
  },
  {
    "issue": "2026111",
    "date": "2026-04-21",
    "regular": [
      24,
      23,
      21,
      41,
      38,
      33
    ],
    "special": 1,
    "zodiacs": [
      "羊",
      "猴",
      "狗",
      "虎",
      "蛇",
      "狗",
      "马"
    ]
  },
  {
    "issue": "2026110",
    "date": "2026-04-20",
    "regular": [
      40,
      3,
      43,
      29,
      45,
      19
    ],
    "special": 30,
    "zodiacs": [
      "兔",
      "龙",
      "鼠",
      "虎",
      "狗",
      "鼠",
      "牛"
    ]
  },
  {
    "issue": "2026109",
    "date": "2026-04-19",
    "regular": [
      38,
      7,
      19,
      24,
      43,
      8
    ],
    "special": 16,
    "zodiacs": [
      "蛇",
      "鼠",
      "鼠",
      "羊",
      "鼠",
      "猪",
      "兔"
    ]
  },
  {
    "issue": "2026108",
    "date": "2026-04-18",
    "regular": [
      6,
      30,
      26,
      14,
      48,
      40
    ],
    "special": 45,
    "zodiacs": [
      "牛",
      "牛",
      "蛇",
      "蛇",
      "羊",
      "兔",
      "狗"
    ]
  },
  {
    "issue": "2026107",
    "date": "2026-04-17",
    "regular": [
      35,
      10,
      41,
      43,
      34,
      6
    ],
    "special": 49,
    "zodiacs": [
      "猴",
      "鸡",
      "虎",
      "鼠",
      "鸡",
      "牛",
      "马"
    ]
  },
  {
    "issue": "2026106",
    "date": "2026-04-16",
    "regular": [
      31,
      48,
      5,
      11,
      46,
      40
    ],
    "special": 22,
    "zodiacs": [
      "鼠",
      "羊",
      "虎",
      "猴",
      "鸡",
      "兔",
      "鸡"
    ]
  },
  {
    "issue": "2026105",
    "date": "2026-04-15",
    "regular": [
      32,
      44,
      17,
      19,
      11,
      36
    ],
    "special": 28,
    "zodiacs": [
      "猪",
      "猪",
      "虎",
      "鼠",
      "猴",
      "羊",
      "兔"
    ]
  },
  {
    "issue": "2026104",
    "date": "2026-04-14",
    "regular": [
      20,
      45,
      39,
      49,
      3,
      48
    ],
    "special": 1,
    "zodiacs": [
      "猪",
      "狗",
      "龙",
      "马",
      "龙",
      "羊",
      "马"
    ]
  },
  {
    "issue": "2026103",
    "date": "2026-04-13",
    "regular": [
      34,
      3,
      1,
      30,
      39,
      4
    ],
    "special": 6,
    "zodiacs": [
      "鸡",
      "龙",
      "马",
      "牛",
      "龙",
      "兔",
      "牛"
    ]
  },
  {
    "issue": "2026102",
    "date": "2026-04-12",
    "regular": [
      47,
      3,
      32,
      46,
      39,
      36
    ],
    "special": 20,
    "zodiacs": [
      "猴",
      "龙",
      "猪",
      "鸡",
      "龙",
      "羊",
      "猪"
    ]
  },
  {
    "issue": "2026101",
    "date": "2026-04-11",
    "regular": [
      22,
      8,
      2,
      34,
      20,
      12
    ],
    "special": 39,
    "zodiacs": [
      "鸡",
      "猪",
      "蛇",
      "鸡",
      "猪",
      "羊",
      "龙"
    ]
  },
  {
    "issue": "2026100",
    "date": "2026-04-10",
    "regular": [
      24,
      45,
      4,
      32,
      3,
      48
    ],
    "special": 33,
    "zodiacs": [
      "羊",
      "狗",
      "兔",
      "猪",
      "龙",
      "羊",
      "狗"
    ]
  },
  {
    "issue": "2026099",
    "date": "2026-04-09",
    "regular": [
      10,
      32,
      22,
      18,
      28,
      17
    ],
    "special": 12,
    "zodiacs": [
      "鸡",
      "猪",
      "鸡",
      "牛",
      "兔",
      "虎",
      "羊"
    ]
  },
  {
    "issue": "2026098",
    "date": "2026-04-08",
    "regular": [
      24,
      8,
      3,
      14,
      32,
      49
    ],
    "special": 17,
    "zodiacs": [
      "羊",
      "猪",
      "龙",
      "蛇",
      "猪",
      "马",
      "虎"
    ]
  },
  {
    "issue": "2026097",
    "date": "2026-04-07",
    "regular": [
      28,
      8,
      44,
      26,
      29,
      46
    ],
    "special": 11,
    "zodiacs": [
      "兔",
      "猪",
      "猪",
      "蛇",
      "虎",
      "鸡",
      "猴"
    ]
  },
  {
    "issue": "2026096",
    "date": "2026-04-06",
    "regular": [
      35,
      37,
      26,
      5,
      25,
      15
    ],
    "special": 43,
    "zodiacs": [
      "猴",
      "马",
      "蛇",
      "虎",
      "马",
      "龙",
      "鼠"
    ]
  },
  {
    "issue": "2026095",
    "date": "2026-04-05",
    "regular": [
      15,
      39,
      1,
      38,
      21,
      48
    ],
    "special": 35,
    "zodiacs": [
      "龙",
      "龙",
      "马",
      "蛇",
      "狗",
      "羊",
      "猴"
    ]
  },
  {
    "issue": "2026094",
    "date": "2026-04-04",
    "regular": [
      16,
      25,
      4,
      28,
      43,
      38
    ],
    "special": 17,
    "zodiacs": [
      "兔",
      "马",
      "兔",
      "兔",
      "鼠",
      "蛇",
      "虎"
    ]
  },
  {
    "issue": "2026093",
    "date": "2026-04-03",
    "regular": [
      13,
      18,
      26,
      47,
      48,
      4
    ],
    "special": 40,
    "zodiacs": [
      "马",
      "牛",
      "蛇",
      "猴",
      "羊",
      "兔",
      "兔"
    ]
  },
  {
    "issue": "2026092",
    "date": "2026-04-02",
    "regular": [
      46,
      42,
      25,
      47,
      38,
      19
    ],
    "special": 6,
    "zodiacs": [
      "鸡",
      "牛",
      "马",
      "猴",
      "蛇",
      "鼠",
      "牛"
    ]
  },
  {
    "issue": "2026091",
    "date": "2026-04-01",
    "regular": [
      8,
      17,
      32,
      5,
      42,
      24
    ],
    "special": 37,
    "zodiacs": [
      "猪",
      "虎",
      "猪",
      "虎",
      "牛",
      "羊",
      "马"
    ]
  },
  {
    "issue": "2026090",
    "date": "2026-03-31",
    "regular": [
      48,
      29,
      20,
      17,
      37,
      8
    ],
    "special": 36,
    "zodiacs": [
      "羊",
      "虎",
      "猪",
      "虎",
      "马",
      "猪",
      "羊"
    ]
  },
  {
    "issue": "2026089",
    "date": "2026-03-30",
    "regular": [
      26,
      44,
      34,
      5,
      21,
      22
    ],
    "special": 49,
    "zodiacs": [
      "蛇",
      "猪",
      "鸡",
      "虎",
      "狗",
      "鸡",
      "马"
    ]
  },
  {
    "issue": "2026088",
    "date": "2026-03-29",
    "regular": [
      16,
      46,
      18,
      10,
      12,
      42
    ],
    "special": 27,
    "zodiacs": [
      "兔",
      "鸡",
      "牛",
      "鸡",
      "羊",
      "牛",
      "龙"
    ]
  },
  {
    "issue": "2026087",
    "date": "2026-03-28",
    "regular": [
      17,
      1,
      21,
      29,
      47,
      2
    ],
    "special": 26,
    "zodiacs": [
      "虎",
      "马",
      "狗",
      "虎",
      "猴",
      "蛇",
      "蛇"
    ]
  },
  {
    "issue": "2026086",
    "date": "2026-03-27",
    "regular": [
      15,
      36,
      14,
      24,
      26,
      34
    ],
    "special": 12,
    "zodiacs": [
      "龙",
      "羊",
      "蛇",
      "羊",
      "蛇",
      "鸡",
      "羊"
    ]
  },
  {
    "issue": "2026085",
    "date": "2026-03-26",
    "regular": [
      14,
      13,
      27,
      33,
      6,
      20
    ],
    "special": 19,
    "zodiacs": [
      "蛇",
      "马",
      "龙",
      "狗",
      "牛",
      "猪",
      "鼠"
    ]
  },
  {
    "issue": "2026084",
    "date": "2026-03-25",
    "regular": [
      7,
      24,
      2,
      5,
      20,
      31
    ],
    "special": 16,
    "zodiacs": [
      "鼠",
      "羊",
      "蛇",
      "虎",
      "猪",
      "鼠",
      "兔"
    ]
  },
  {
    "issue": "2026083",
    "date": "2026-03-24",
    "regular": [
      46,
      8,
      23,
      36,
      30,
      1
    ],
    "special": 5,
    "zodiacs": [
      "鸡",
      "猪",
      "猴",
      "羊",
      "牛",
      "马",
      "虎"
    ]
  },
  {
    "issue": "2026082",
    "date": "2026-03-23",
    "regular": [
      3,
      21,
      33,
      37,
      41,
      25
    ],
    "special": 27,
    "zodiacs": [
      "龙",
      "狗",
      "狗",
      "马",
      "虎",
      "马",
      "龙"
    ]
  },
  {
    "issue": "2026081",
    "date": "2026-03-22",
    "regular": [
      4,
      36,
      14,
      15,
      35,
      41
    ],
    "special": 17,
    "zodiacs": [
      "兔",
      "羊",
      "蛇",
      "龙",
      "猴",
      "虎",
      "虎"
    ]
  },
  {
    "issue": "2026080",
    "date": "2026-03-21",
    "regular": [
      21,
      18,
      17,
      48,
      9,
      42
    ],
    "special": 3,
    "zodiacs": [
      "狗",
      "牛",
      "虎",
      "羊",
      "狗",
      "牛",
      "龙"
    ]
  },
  {
    "issue": "2026079",
    "date": "2026-03-20",
    "regular": [
      49,
      34,
      6,
      20,
      4,
      43
    ],
    "special": 35,
    "zodiacs": [
      "马",
      "鸡",
      "牛",
      "猪",
      "兔",
      "鼠",
      "猴"
    ]
  },
  {
    "issue": "2026078",
    "date": "2026-03-19",
    "regular": [
      18,
      17,
      10,
      33,
      2,
      8
    ],
    "special": 46,
    "zodiacs": [
      "牛",
      "虎",
      "鸡",
      "狗",
      "蛇",
      "猪",
      "鸡"
    ]
  },
  {
    "issue": "2026077",
    "date": "2026-03-18",
    "regular": [
      37,
      32,
      46,
      25,
      39,
      30
    ],
    "special": 29,
    "zodiacs": [
      "马",
      "猪",
      "鸡",
      "马",
      "龙",
      "牛",
      "虎"
    ]
  },
  {
    "issue": "2026076",
    "date": "2026-03-17",
    "regular": [
      12,
      7,
      24,
      22,
      3,
      41
    ],
    "special": 2,
    "zodiacs": [
      "羊",
      "鼠",
      "羊",
      "鸡",
      "龙",
      "虎",
      "蛇"
    ]
  },
  {
    "issue": "2026075",
    "date": "2026-03-16",
    "regular": [
      19,
      22,
      26,
      20,
      41,
      27
    ],
    "special": 33,
    "zodiacs": [
      "鼠",
      "鸡",
      "蛇",
      "猪",
      "虎",
      "龙",
      "狗"
    ]
  },
  {
    "issue": "2026074",
    "date": "2026-03-15",
    "regular": [
      12,
      31,
      49,
      25,
      24,
      32
    ],
    "special": 10,
    "zodiacs": [
      "羊",
      "鼠",
      "马",
      "马",
      "羊",
      "猪",
      "鸡"
    ]
  },
  {
    "issue": "2026073",
    "date": "2026-03-14",
    "regular": [
      7,
      29,
      1,
      33,
      36,
      14
    ],
    "special": 34,
    "zodiacs": [
      "鼠",
      "虎",
      "马",
      "狗",
      "羊",
      "蛇",
      "鸡"
    ]
  },
  {
    "issue": "2026072",
    "date": "2026-03-13",
    "regular": [
      12,
      28,
      1,
      42,
      25,
      44
    ],
    "special": 46,
    "zodiacs": [
      "羊",
      "兔",
      "马",
      "牛",
      "马",
      "猪",
      "鸡"
    ]
  },
  {
    "issue": "2026071",
    "date": "2026-03-12",
    "regular": [
      44,
      30,
      25,
      5,
      41,
      8
    ],
    "special": 48,
    "zodiacs": [
      "猪",
      "牛",
      "马",
      "虎",
      "虎",
      "猪",
      "羊"
    ]
  },
  {
    "issue": "2026070",
    "date": "2026-03-11",
    "regular": [
      47,
      17,
      23,
      10,
      41,
      7
    ],
    "special": 25,
    "zodiacs": [
      "猴",
      "虎",
      "猴",
      "鸡",
      "虎",
      "鼠",
      "马"
    ]
  },
  {
    "issue": "2026069",
    "date": "2026-03-10",
    "regular": [
      23,
      16,
      10,
      34,
      8,
      36
    ],
    "special": 24,
    "zodiacs": [
      "猴",
      "兔",
      "鸡",
      "鸡",
      "猪",
      "羊",
      "羊"
    ]
  },
  {
    "issue": "2026068",
    "date": "2026-03-09",
    "regular": [
      49,
      2,
      1,
      26,
      38,
      21
    ],
    "special": 23,
    "zodiacs": [
      "马",
      "蛇",
      "马",
      "蛇",
      "蛇",
      "狗",
      "猴"
    ]
  },
  {
    "issue": "2026067",
    "date": "2026-03-08",
    "regular": [
      15,
      30,
      6,
      1,
      26,
      9
    ],
    "special": 5,
    "zodiacs": [
      "龙",
      "牛",
      "牛",
      "马",
      "蛇",
      "狗",
      "虎"
    ]
  },
  {
    "issue": "2026066",
    "date": "2026-03-07",
    "regular": [
      24,
      20,
      36,
      44,
      2,
      28
    ],
    "special": 37,
    "zodiacs": [
      "羊",
      "猪",
      "羊",
      "猪",
      "蛇",
      "兔",
      "马"
    ]
  },
  {
    "issue": "2026065",
    "date": "2026-03-06",
    "regular": [
      2,
      45,
      17,
      38,
      33,
      24
    ],
    "special": 5,
    "zodiacs": [
      "蛇",
      "狗",
      "虎",
      "蛇",
      "狗",
      "羊",
      "虎"
    ]
  },
  {
    "issue": "2026064",
    "date": "2026-03-05",
    "regular": [
      8,
      23,
      40,
      44,
      34,
      2
    ],
    "special": 18,
    "zodiacs": [
      "猪",
      "猴",
      "兔",
      "猪",
      "鸡",
      "蛇",
      "牛"
    ]
  },
  {
    "issue": "2026063",
    "date": "2026-03-04",
    "regular": [
      36,
      26,
      37,
      2,
      44,
      31
    ],
    "special": 28,
    "zodiacs": [
      "羊",
      "蛇",
      "马",
      "蛇",
      "猪",
      "鼠",
      "兔"
    ]
  },
  {
    "issue": "2026062",
    "date": "2026-03-03",
    "regular": [
      46,
      29,
      6,
      49,
      35,
      42
    ],
    "special": 24,
    "zodiacs": [
      "鸡",
      "虎",
      "牛",
      "马",
      "猴",
      "牛",
      "羊"
    ]
  },
  {
    "issue": "2026061",
    "date": "2026-03-02",
    "regular": [
      46,
      17,
      8,
      25,
      2,
      37
    ],
    "special": 29,
    "zodiacs": [
      "鸡",
      "虎",
      "猪",
      "马",
      "蛇",
      "马",
      "虎"
    ]
  },
  {
    "issue": "2026060",
    "date": "2026-03-01",
    "regular": [
      5,
      27,
      40,
      34,
      39,
      1
    ],
    "special": 9,
    "zodiacs": [
      "虎",
      "龙",
      "兔",
      "鸡",
      "龙",
      "马",
      "狗"
    ]
  },
  {
    "issue": "2026059",
    "date": "2026-02-28",
    "regular": [
      29,
      19,
      24,
      43,
      28,
      12
    ],
    "special": 10,
    "zodiacs": [
      "虎",
      "鼠",
      "羊",
      "鼠",
      "兔",
      "羊",
      "鸡"
    ]
  },
  {
    "issue": "2026058",
    "date": "2026-02-27",
    "regular": [
      20,
      38,
      13,
      21,
      33,
      40
    ],
    "special": 31,
    "zodiacs": [
      "猪",
      "蛇",
      "马",
      "狗",
      "狗",
      "兔",
      "鼠"
    ]
  },
  {
    "issue": "2026057",
    "date": "2026-02-26",
    "regular": [
      21,
      29,
      40,
      30,
      26,
      34
    ],
    "special": 23,
    "zodiacs": [
      "狗",
      "虎",
      "兔",
      "牛",
      "蛇",
      "鸡",
      "猴"
    ]
  },
  {
    "issue": "2026056",
    "date": "2026-02-25",
    "regular": [
      45,
      9,
      6,
      7,
      10,
      26
    ],
    "special": 48,
    "zodiacs": [
      "狗",
      "狗",
      "牛",
      "鼠",
      "鸡",
      "蛇",
      "羊"
    ]
  },
  {
    "issue": "2026055",
    "date": "2026-02-24",
    "regular": [
      31,
      28,
      20,
      21,
      39,
      9
    ],
    "special": 14,
    "zodiacs": [
      "鼠",
      "兔",
      "猪",
      "狗",
      "龙",
      "狗",
      "蛇"
    ]
  },
  {
    "issue": "2026054",
    "date": "2026-02-23",
    "regular": [
      37,
      30,
      11,
      19,
      49,
      32
    ],
    "special": 48,
    "zodiacs": [
      "马",
      "牛",
      "猴",
      "鼠",
      "马",
      "猪",
      "羊"
    ]
  },
  {
    "issue": "2026053",
    "date": "2026-02-22",
    "regular": [
      16,
      12,
      33,
      17,
      41,
      18
    ],
    "special": 15,
    "zodiacs": [
      "兔",
      "羊",
      "狗",
      "虎",
      "虎",
      "牛",
      "龙"
    ]
  },
  {
    "issue": "2026052",
    "date": "2026-02-21",
    "regular": [
      15,
      46,
      14,
      13,
      40,
      35
    ],
    "special": 38,
    "zodiacs": [
      "龙",
      "鸡",
      "蛇",
      "马",
      "兔",
      "猴",
      "蛇"
    ]
  },
  {
    "issue": "2026051",
    "date": "2026-02-20",
    "regular": [
      40,
      42,
      44,
      6,
      14,
      38
    ],
    "special": 1,
    "zodiacs": [
      "兔",
      "牛",
      "猪",
      "牛",
      "蛇",
      "蛇",
      "马"
    ]
  },
  {
    "issue": "2026050",
    "date": "2026-02-19",
    "regular": [
      10,
      13,
      30,
      37,
      33,
      44
    ],
    "special": 23,
    "zodiacs": [
      "鸡",
      "马",
      "牛",
      "马",
      "狗",
      "猪",
      "猴"
    ]
  },
  {
    "issue": "2026049",
    "date": "2026-02-18",
    "regular": [
      28,
      42,
      22,
      49,
      12,
      31
    ],
    "special": 13,
    "zodiacs": [
      "兔",
      "牛",
      "鸡",
      "马",
      "羊",
      "鼠",
      "马"
    ]
  },
  {
    "issue": "2026048",
    "date": "2026-02-17",
    "regular": [
      8,
      38,
      29,
      32,
      46,
      16
    ],
    "special": 24,
    "zodiacs": [
      "猪",
      "蛇",
      "虎",
      "猪",
      "鸡",
      "兔",
      "羊"
    ]
  },
  {
    "issue": "2026047",
    "date": "2026-02-16",
    "regular": [
      40,
      35,
      23,
      42,
      46,
      47
    ],
    "special": 39,
    "zodiacs": [
      "虎",
      "羊",
      "羊",
      "鼠",
      "猴",
      "羊",
      "兔"
    ]
  },
  {
    "issue": "2026046",
    "date": "2026-02-15",
    "regular": [
      13,
      9,
      20,
      22,
      39,
      36
    ],
    "special": 3,
    "zodiacs": [
      "蛇",
      "鸡",
      "狗",
      "猴",
      "兔",
      "马",
      "兔"
    ]
  },
  {
    "issue": "2026045",
    "date": "2026-02-14",
    "regular": [
      20,
      38,
      22,
      13,
      42,
      27
    ],
    "special": 1,
    "zodiacs": [
      "狗",
      "龙",
      "猴",
      "蛇",
      "鼠",
      "兔",
      "蛇"
    ]
  },
  {
    "issue": "2026044",
    "date": "2026-02-13",
    "regular": [
      46,
      17,
      39,
      47,
      48,
      38
    ],
    "special": 19,
    "zodiacs": [
      "猴",
      "牛",
      "兔",
      "羊",
      "马",
      "龙",
      "猪"
    ]
  },
  {
    "issue": "2026043",
    "date": "2026-02-12",
    "regular": [
      9,
      35,
      42,
      40,
      33,
      3
    ],
    "special": 13,
    "zodiacs": [
      "鸡",
      "羊",
      "鼠",
      "虎",
      "鸡",
      "兔",
      "蛇"
    ]
  },
  {
    "issue": "2026042",
    "date": "2026-02-11",
    "regular": [
      38,
      22,
      17,
      19,
      1,
      18
    ],
    "special": 16,
    "zodiacs": [
      "龙",
      "猴",
      "牛",
      "猪",
      "蛇",
      "鼠",
      "虎"
    ]
  },
  {
    "issue": "2026041",
    "date": "2026-02-10",
    "regular": [
      2,
      8,
      17,
      44,
      32,
      27
    ],
    "special": 36,
    "zodiacs": [
      "龙",
      "狗",
      "牛",
      "狗",
      "狗",
      "兔",
      "马"
    ]
  },
  {
    "issue": "2026040",
    "date": "2026-02-09",
    "regular": [
      46,
      6,
      29,
      27,
      11,
      49
    ],
    "special": 28,
    "zodiacs": [
      "猴",
      "鼠",
      "牛",
      "兔",
      "羊",
      "蛇",
      "虎"
    ]
  },
  {
    "issue": "2026039",
    "date": "2026-02-08",
    "regular": [
      31,
      20,
      8,
      29,
      10,
      4
    ],
    "special": 11,
    "zodiacs": [
      "猪",
      "狗",
      "狗",
      "牛",
      "猴",
      "虎",
      "羊"
    ]
  },
  {
    "issue": "2026038",
    "date": "2026-02-07",
    "regular": [
      6,
      40,
      49,
      34,
      12,
      20
    ],
    "special": 42,
    "zodiacs": [
      "鼠",
      "虎",
      "蛇",
      "猴",
      "马",
      "狗",
      "鼠"
    ]
  },
  {
    "issue": "2026037",
    "date": "2026-02-06",
    "regular": [
      34,
      42,
      39,
      13,
      44,
      45
    ],
    "special": 43,
    "zodiacs": [
      "猴",
      "鼠",
      "兔",
      "蛇",
      "狗",
      "鸡",
      "猪"
    ]
  },
  {
    "issue": "2026036",
    "date": "2026-02-05",
    "regular": [
      44,
      39,
      11,
      20,
      27,
      48
    ],
    "special": 1,
    "zodiacs": [
      "狗",
      "兔",
      "羊",
      "狗",
      "兔",
      "马",
      "蛇"
    ]
  },
  {
    "issue": "2026035",
    "date": "2026-02-04",
    "regular": [
      32,
      47,
      44,
      36,
      19,
      41
    ],
    "special": 27,
    "zodiacs": [
      "狗",
      "羊",
      "狗",
      "马",
      "猪",
      "牛",
      "兔"
    ]
  },
  {
    "issue": "2026034",
    "date": "2026-02-03",
    "regular": [
      38,
      45,
      35,
      24,
      30,
      23
    ],
    "special": 19,
    "zodiacs": [
      "龙",
      "鸡",
      "羊",
      "马",
      "鼠",
      "羊",
      "猪"
    ]
  },
  {
    "issue": "2026033",
    "date": "2026-02-02",
    "regular": [
      14,
      22,
      46,
      33,
      8,
      11
    ],
    "special": 41,
    "zodiacs": [
      "龙",
      "猴",
      "猴",
      "鸡",
      "狗",
      "羊",
      "牛"
    ]
  },
  {
    "issue": "2026032",
    "date": "2026-02-01",
    "regular": [
      23,
      17,
      11,
      20,
      10,
      39
    ],
    "special": 6,
    "zodiacs": [
      "羊",
      "牛",
      "羊",
      "狗",
      "猴",
      "兔",
      "鼠"
    ]
  },
  {
    "issue": "2026031",
    "date": "2026-01-31",
    "regular": [
      38,
      25,
      7,
      19,
      11,
      5
    ],
    "special": 26,
    "zodiacs": [
      "龙",
      "蛇",
      "猪",
      "猪",
      "羊",
      "牛",
      "龙"
    ]
  },
  {
    "issue": "2026030",
    "date": "2026-01-30",
    "regular": [
      3,
      6,
      47,
      1,
      35,
      4
    ],
    "special": 41,
    "zodiacs": [
      "兔",
      "鼠",
      "羊",
      "蛇",
      "羊",
      "虎",
      "牛"
    ]
  },
  {
    "issue": "2026029",
    "date": "2026-01-29",
    "regular": [
      47,
      8,
      5,
      4,
      3,
      18
    ],
    "special": 1,
    "zodiacs": [
      "羊",
      "狗",
      "牛",
      "虎",
      "兔",
      "鼠",
      "蛇"
    ]
  },
  {
    "issue": "2026028",
    "date": "2026-01-28",
    "regular": [
      17,
      47,
      28,
      39,
      32,
      49
    ],
    "special": 3,
    "zodiacs": [
      "牛",
      "羊",
      "虎",
      "兔",
      "狗",
      "蛇",
      "兔"
    ]
  },
  {
    "issue": "2026027",
    "date": "2026-01-27",
    "regular": [
      11,
      16,
      46,
      10,
      18,
      49
    ],
    "special": 45,
    "zodiacs": [
      "羊",
      "虎",
      "猴",
      "猴",
      "鼠",
      "蛇",
      "鸡"
    ]
  },
  {
    "issue": "2026026",
    "date": "2026-01-26",
    "regular": [
      44,
      34,
      24,
      13,
      37,
      42
    ],
    "special": 19,
    "zodiacs": [
      "狗",
      "猴",
      "马",
      "蛇",
      "蛇",
      "鼠",
      "猪"
    ]
  },
  {
    "issue": "2026025",
    "date": "2026-01-25",
    "regular": [
      46,
      10,
      41,
      6,
      9,
      14
    ],
    "special": 37,
    "zodiacs": [
      "猴",
      "猴",
      "牛",
      "鼠",
      "鸡",
      "龙",
      "蛇"
    ]
  },
  {
    "issue": "2026024",
    "date": "2026-01-24",
    "regular": [
      10,
      45,
      25,
      15,
      23,
      44
    ],
    "special": 28,
    "zodiacs": [
      "猴",
      "鸡",
      "蛇",
      "兔",
      "羊",
      "狗",
      "虎"
    ]
  },
  {
    "issue": "2026023",
    "date": "2026-01-23",
    "regular": [
      6,
      29,
      36,
      38,
      18,
      31
    ],
    "special": 47,
    "zodiacs": [
      "鼠",
      "牛",
      "马",
      "龙",
      "鼠",
      "猪",
      "羊"
    ]
  },
  {
    "issue": "2026022",
    "date": "2026-01-22",
    "regular": [
      39,
      8,
      20,
      37,
      46,
      30
    ],
    "special": 18,
    "zodiacs": [
      "兔",
      "狗",
      "狗",
      "蛇",
      "猴",
      "鼠",
      "鼠"
    ]
  },
  {
    "issue": "2026021",
    "date": "2026-01-21",
    "regular": [
      47,
      45,
      33,
      7,
      24,
      10
    ],
    "special": 42,
    "zodiacs": [
      "羊",
      "鸡",
      "鸡",
      "猪",
      "马",
      "猴",
      "鼠"
    ]
  },
  {
    "issue": "2026020",
    "date": "2026-01-20",
    "regular": [
      9,
      37,
      14,
      47,
      11,
      24
    ],
    "special": 12,
    "zodiacs": [
      "鸡",
      "蛇",
      "龙",
      "羊",
      "羊",
      "马",
      "马"
    ]
  },
  {
    "issue": "2026019",
    "date": "2026-01-19",
    "regular": [
      42,
      22,
      45,
      19,
      7,
      25
    ],
    "special": 46,
    "zodiacs": [
      "鼠",
      "猴",
      "鸡",
      "猪",
      "猪",
      "蛇",
      "猴"
    ]
  },
  {
    "issue": "2026018",
    "date": "2026-01-18",
    "regular": [
      40,
      42,
      43,
      31,
      25,
      15
    ],
    "special": 39,
    "zodiacs": [
      "虎",
      "鼠",
      "猪",
      "猪",
      "蛇",
      "兔",
      "兔"
    ]
  },
  {
    "issue": "2026017",
    "date": "2026-01-17",
    "regular": [
      44,
      18,
      31,
      41,
      33,
      2
    ],
    "special": 32,
    "zodiacs": [
      "狗",
      "鼠",
      "猪",
      "牛",
      "鸡",
      "龙",
      "狗"
    ]
  },
  {
    "issue": "2026016",
    "date": "2026-01-16",
    "regular": [
      34,
      12,
      48,
      26,
      40,
      38
    ],
    "special": 6,
    "zodiacs": [
      "猴",
      "马",
      "马",
      "龙",
      "虎",
      "龙",
      "鼠"
    ]
  },
  {
    "issue": "2026015",
    "date": "2026-01-15",
    "regular": [
      10,
      8,
      30,
      20,
      15,
      33
    ],
    "special": 31,
    "zodiacs": [
      "猴",
      "狗",
      "鼠",
      "狗",
      "兔",
      "鸡",
      "猪"
    ]
  },
  {
    "issue": "2026014",
    "date": "2026-01-14",
    "regular": [
      38,
      13,
      12,
      8,
      43,
      31
    ],
    "special": 26,
    "zodiacs": [
      "龙",
      "蛇",
      "马",
      "狗",
      "猪",
      "猪",
      "龙"
    ]
  },
  {
    "issue": "2026013",
    "date": "2026-01-13",
    "regular": [
      9,
      19,
      44,
      27,
      37,
      6
    ],
    "special": 1,
    "zodiacs": [
      "鸡",
      "猪",
      "狗",
      "兔",
      "蛇",
      "鼠",
      "蛇"
    ]
  },
  {
    "issue": "2026012",
    "date": "2026-01-12",
    "regular": [
      25,
      26,
      33,
      20,
      41,
      45
    ],
    "special": 11,
    "zodiacs": [
      "蛇",
      "龙",
      "鸡",
      "狗",
      "牛",
      "鸡",
      "羊"
    ]
  },
  {
    "issue": "2026011",
    "date": "2026-01-11",
    "regular": [
      32,
      10,
      7,
      5,
      48,
      15
    ],
    "special": 11,
    "zodiacs": [
      "狗",
      "猴",
      "猪",
      "牛",
      "马",
      "兔",
      "羊"
    ]
  },
  {
    "issue": "2026010",
    "date": "2026-01-10",
    "regular": [
      23,
      38,
      24,
      49,
      11,
      30
    ],
    "special": 27,
    "zodiacs": [
      "羊",
      "龙",
      "马",
      "蛇",
      "羊",
      "鼠",
      "兔"
    ]
  },
  {
    "issue": "2026009",
    "date": "2026-01-09",
    "regular": [
      17,
      18,
      6,
      49,
      7,
      22
    ],
    "special": 28,
    "zodiacs": [
      "牛",
      "鼠",
      "鼠",
      "蛇",
      "猪",
      "猴",
      "虎"
    ]
  },
  {
    "issue": "2026008",
    "date": "2026-01-08",
    "regular": [
      5,
      39,
      36,
      19,
      29,
      45
    ],
    "special": 21,
    "zodiacs": [
      "牛",
      "兔",
      "马",
      "猪",
      "牛",
      "鸡",
      "鸡"
    ]
  },
  {
    "issue": "2026007",
    "date": "2026-01-07",
    "regular": [
      28,
      40,
      45,
      34,
      44,
      15
    ],
    "special": 41,
    "zodiacs": [
      "虎",
      "虎",
      "鸡",
      "猴",
      "狗",
      "兔",
      "牛"
    ]
  },
  {
    "issue": "2026006",
    "date": "2026-01-06",
    "regular": [
      35,
      41,
      15,
      6,
      46,
      21
    ],
    "special": 13,
    "zodiacs": [
      "羊",
      "牛",
      "兔",
      "鼠",
      "猴",
      "鸡",
      "蛇"
    ]
  },
  {
    "issue": "2026005",
    "date": "2026-01-05",
    "regular": [
      46,
      19,
      20,
      36,
      13,
      17
    ],
    "special": 43,
    "zodiacs": [
      "猴",
      "猪",
      "狗",
      "马",
      "蛇",
      "牛",
      "猪"
    ]
  },
  {
    "issue": "2026004",
    "date": "2026-01-04",
    "regular": [
      22,
      19,
      7,
      35,
      49,
      36
    ],
    "special": 45,
    "zodiacs": [
      "猴",
      "猪",
      "猪",
      "羊",
      "蛇",
      "马",
      "鸡"
    ]
  },
  {
    "issue": "2026003",
    "date": "2026-01-03",
    "regular": [
      30,
      44,
      7,
      15,
      42,
      17
    ],
    "special": 9,
    "zodiacs": [
      "鼠",
      "狗",
      "猪",
      "兔",
      "鼠",
      "牛",
      "鸡"
    ]
  },
  {
    "issue": "2026002",
    "date": "2026-01-02",
    "regular": [
      48,
      7,
      4,
      3,
      15,
      11
    ],
    "special": 22,
    "zodiacs": [
      "马",
      "猪",
      "虎",
      "兔",
      "兔",
      "羊",
      "猴"
    ]
  },
  {
    "issue": "2026001",
    "date": "2026-01-01",
    "regular": [
      27,
      8,
      43,
      33,
      42,
      11
    ],
    "special": 29,
    "zodiacs": [
      "兔",
      "狗",
      "猪",
      "鸡",
      "鼠",
      "羊",
      "牛"
    ]
  }
];
